views/notasalumnoasignatura/_search.php

SELECT * FROM `carrera` WHERE `idCarr` IN ('054', '206', '056')
SELECT * FROM `carrera` WHERE (`culminacion`=1) AND (`idCarr` IN ('003', '056', '197', '206'))
---
			->groupBy(['idcarr'])
			->orderBy(['fecha'=> 'DESC'])
			->all(), 'idcarr');
$carreras = ArrayHelper::getColumn(Carrera::find()->where(['idCarr'=> $matriculas])->all(), 'idCarr');
$dataPost=ArrayHelper::map(Carrera::find()->Where(['culminacion' => 1, 'idCarr'=> $carreras ])->all(), 'idCarr', 'NombCarr');