views/notasalumnoasignatura/_searchsnna.php

        'action' => ['snna'],
        'method' => 'get',
    ]); ?>
	<?php $items = \yii\helpers\ArrayHelper::map(Periodolectivo::find()->orderBy(['idper'=>SORT_DESC])->all(),
			'idper', 'DescPerLec'); ?>
---
SELECT * FROM `periodolectivo` ORDER BY `idper` DESC