views/notasalumnoasignatura/index.php

SELECT * FROM `informacionpersonal` WHERE CIInfPer = 0912643756
---
$nombre = '';
/*
if (isset($searchModel->CIInfPer) && (!empty($searchModel->CIInfPer)) ) {
	$estudiante = Informacionpersonal::find()
	->where("CIInfPer = $searchModel->CIInfPer")
	->one();