views/layouts/column3.php

			<?php
				$cedula = (isset($_GET['NotasalumnoasignaturaSearch']['CIInfPer']) ?
								$_GET['NotasalumnoasignaturaSearch']['CIInfPer'] : '');
				$alumno = Informacionpersonal::find()
					->where(['CIInfPer' => $cedula])
					->one();
---
SELECT * FROM `informacionpersonal` WHERE `CIInfPer`='0802126102'

				if($carrera == '') $carrera = '000';

				if($cedula == '') $cedula = '000';
				$nombrecarrera = Carrera::find()
				->where(['idCarr' => $carrera])
				->one();
---
SELECT * FROM `carrera` WHERE `idCarr`='046'