views/layouts/column2.php

SELECT * FROM `informacionpersonal` WHERE `CIInfPer`='0802126102'
---
			<?php
				use app\models\Informacionpersonal;
				$cedula = (isset($_GET['NotasSicSearch']['cedula']) ? $_GET['NotasSicSearch']['cedula'] : '');
				$alumno = Informacionpersonal::find()
					->where(['CIInfPer' => $cedula])
					->one();