controllers/DetallematriculaController.php

    public function actionIndex( $idfactura)
    {
		$factura = Factura::find()
				->where(['id'=>$idfactura])
				->one();
		$hoy = date("Y-m-d");
		$fechamax = '';
		#$this->view->params['eliminar'] = 0;
		$this->view->params['eliminar'] = 1;
		$periodo = Periodolectivo::find()
				->where(['StatusPerLec'=>1])
				->one();
---
SELECT * FROM `factura` WHERE `id`='14400'
SELECT * FROM `periodolectivo` WHERE `StatusPerLec`=1

    public function actionDelete($id)
    {

		if ($model = $this->findModel($id)){

			$usuario = Yii::$app->user->identity;
			$alumno = $model->factura->cedula0;
			$periodo = $model->factura->periodo;
			$contarnotas = count($model->notas);
			$hoy = date("Y-m-d");

			if ($periodo && $usuario && $contarnotas == 0 && $alumno ) {
				$fecha_tope = $periodo->fechamaxeliminarmatricula;
				//echo var_dump($model->idcarr); exit;
				if ( $fecha_tope >= $hoy && ($usuario->idperfil == 'diracad' || $usuario->idperfil == 'sa') &&
					( in_array($model->idcarr, explode("'", $usuario->idcarr)) ||
					in_array('%', explode("'", $usuario->idcarr)) ) ) {
					//echo var_dump($periodo->idper, '-', $idperiodo, '-', $fecha_tope, '-', $hoy); exit;
					$user = $usuario->LoginUsu;
					$cedula = $model->factura->cedula;
					$email = $alumno->mailPer;
					$asignatura = $model->idAsig->NombAsig;
					$carrera = $model->idCarr0?$model->idCarr0->NombCarr:'';
					$nivel = $model->nivel;
					$paralelo = $model->paralelo;
					$idnota = $model->idnota;
					$idfactura = $model->idfactura;
					$notaalumno = Notasalumnoasignatura::find()
									->where(['idnaa'=> $idnota])
									->one();
					#$model->estado = 0;
					if ($model->delete()) {
						$total = DetalleMatricula::find()
								->where(['idfactura'=>$idfactura, 'estado'=> 1])->sum('credito*costo');
						//echo var_dump($total); exit;
						   // return $this->redirect(Yii::$app->request->referrer);
						if ($total >= 0) {
							$factura = Factura::find()
										->where(['id'=> $idfactura])
										->one();
							if ($factura) {
								$factura->valor_credito = $total;
								$factura->total = $factura->valor_matricula + $factura->valor_otro + $total;
								$factura->save();
---
SELECT * FROM `notasalumnoasignatura` WHERE `idnaa` IS NULL
SELECT SUM(credito*costo) FROM `detalle_matricula` WHERE (`idfactura`=14400) AND (`estado`=1)
SELECT * FROM `factura` WHERE `id`=14400
UPDATE `factura` SET `valor_credito`='0.00', `total`='0' WHERE `id`=14400

						$bitacora->bt_accion = 'Anulación Matrícula';
						$bitacora->bt_ippc = Yii::$app->getRequest()->getUserIP();
						$bitacora->bt_observacion = $texto;
						$bitacora->save();
---
INSERT INTO `bitacora` (`bt_usuario`, `bt_fechahora`, `bt_accion`, `bt_ippc`, `bt_observacion`) VALUES ('1802251759', '2018-05-30 16:40:44', 'Anulación Matrícula', '127.0.0.1', 'De acuerdo a lo solicitado, Dirección de Carrera con usuario:1802251759 ha procedido con la anulación de matrícula Alumno Cédula: 0850032632 Carrera: HOTELERÍA Y TURISMO Asignatura: CONTABILIDAD II nivel: 2 paralelo: B Fecha: 2018-05-30 16:40:44')

    protected function findModel($id)
    {
        if (($model = DetalleMatricula::findOne($id)) !== null) {
---
SELECT * FROM `detalle_matricula` WHERE `id`='103683'