controllers/EquivalenciaController.php

INSERT INTO `equivalencia` (`asignatura`, `fecha`, `usuario`, `equivalencia`) VALUES ('8682', '2016-08-01 11:15:35', 'cplata', '8847')
---
    public function actionCreate($idAsig)
    {

        $model = new Equivalencia();
		$model->asignatura = $idAsig;
		$model->fecha = date('Y-m-d H:i:s');
		$model->usuario = Yii::$app->user->id;
		$url = yii::$app->session->get('url');

		$usuario = Yii::$app->user->identity;
		if ($usuario) {
			if ($usuario->idperfil == 'sa' || $usuario->idperfil == 'diracad') {

				if ($model->load(Yii::$app->request->post()) && $model->save()) {