controllers/FacturaController.php

    public function actionIndex()
    {
	//$this->layout = "/matriculafactura";
	Url::remember();
	$cedula = (isset($_GET['FacturaSearch']['cedula']) ? $_GET['FacturaSearch']['cedula'] : '');
	$id = (isset($_GET['FacturaSearch']['id']) ? $_GET['FacturaSearch']['id'] : '');
	$detalle_matricula = '';
	if ($id != '' && !is_null($id)){
		$factura = Factura::find()
				->where(['id' => $id])
				->andFilterWhere(['cedula' => $cedula])
				->orderBy(['idper' => SORT_DESC])
				->one();
		if ($factura){
			$cedula = $factura->cedula;
			$detalle_matricula = DetalleMatricula::find()
						->where(['idfactura'=>$factura->id]);
		}
	}
	elseif ($cedula != '' && !is_null($cedula)) {
		$factura = Factura::find()
				->where(['cedula' => $cedula])
				//->andFilterWhere(['id' => $id])
				->orderBy(['idper' => SORT_DESC])
				->one();
---
SELECT * FROM `factura` WHERE `cedula`='0804237162' ORDER BY `idper` DESC