controllers/LibretacalificacionController.php

			$fill=!$fill;

			//***************************************************************************
			$notasalumno = Notasalumnoasignatura::find()
										->where(['iddetalle'=> $row["iddetallematricula"]])
										->one();
---
SELECT * FROM `notasalumnoasignatura` WHERE `iddetalle`='95456'

	protected function findCurso($idcurso)
    {
        if (($model = CursoOfertado::findOne($idcurso)) !== null) {
---
SELECT * FROM `curso_ofertado` WHERE `id`='6575'