controllers/MallaestudianteController.php

    public function actionCreate()
    {
		$usuario = Yii::$app->user->identity;

        $model = new MallaEstudiante();
		$model->fecha = date('Y-m-d H:i:s');

        if ($model->load(Yii::$app->request->post()) && ($usuario->idperfil == 'sa' ||
					$usuario->idperfil == 'diracad' || $usuario->idperfil == 'centros') ) {
			$model->save();
---
INSERT INTO `malla_estudiante` (`fecha`, `cedula`, `carrera`, `anio_habilitacion`) VALUES ('2016-07-28 14:32:41', '0912643756', '197', '2014')