controllers/MatriculaController.php

SELECT * FROM `periodolectivo` WHERE `idper`='109'
SELECT * FROM `periodolectivo` ORDER BY `idper` DESC
---
    public function actionIndex() {

	$parametros = Yii::$app->request->queryParams;
	#echo var_dump($parametros); exit;
	if ($parametros) {
		$idper = $parametros ["MatriculaSearch"]["idperiodo"];
		$periodo = Periodolectivo::find()
			->where(['idper' => $idper ])
			->one();
	}
	else {
		$periodo = Periodolectivo::find()
			->orderBy(['idper' => SORT_DESC])
			->one();