controllers/NotassicController.php

	public function actionSubirnota($cedula, $idcarrera, $nivel, $codigo, $calificacion, $estado, $fecha)
	{
		$periodo = Periodolectivo::find()
			->where(['>=','fechinicioperlec',$fecha])
			->one();
		$usuario = Yii::$app->user->identity;
		$model = $this->findModel($codigo, $cedula, $idcarrera, $nivel,$estado, $fecha);


		if ($usuario && $periodo && $model) {
			if ( $usuario->idperfil == 'diracad' || $usuario->idperfil == 'sa' ) {


				$matricula = Matricula::find()
					->where("idPer = $periodo->idper and CIInfPer = '.$cedula.' and idCarr = $idcarrera and idsemestre = $nivel")
					->one();
---
SELECT * FROM `periodolectivo` WHERE `fechinicioperlec` >= '2012-10-01'
SELECT * FROM `matricula` WHERE idPer = 97 and CIInfPer = 0802126102 and idCarr = 46 and idsemestre = 6