controllers/NotasalumnoasignaturaController.php

SELECT * FROM `periodolectivo` WHERE `StatusPerLec`=1
SELECT * FROM `carrera` WHERE `StatusCarr`=1 ORDER BY `nombcarr`
SELECT * FROM `periodolectivo` ORDER BY `idper` DESC LIMIT 12
---
	public function actionSnna() {
		#$usuario = Yii::$app->user->identity;
		#if ($usuario) {
		$periodo = Periodolectivo::find()
						->where(['StatusPerLec'=> 1])
						->one();

			$carreras = ArrayHelper::map(Carrera::find()->where(['StatusCarr' => 1])
									->orderBy(['nombcarr'=>SORT_ASC])
									->all(), 'idCarr', 'NombCarr');
			$periodos = ArrayHelper::map(Periodolectivo::find()
															->orderBy(['idper'=>SORT_DESC])
															->limit(12)
															->all(), 'idper', 'DescPerLec');

SELECT * FROM `carrera` WHERE `StatusCarr`=1 ORDER BY `nombcarr`
SELECT * FROM `periodolectivo` ORDER BY `idper` DESC
---
	public function actionVermejores() {
		$usuario = Yii::$app->user->identity;
		if ($usuario) {

			$carreras_user = explode("'", $usuario->idcarr);
			if (in_array('%', $carreras_user)) {
				$carreras = ArrayHelper::map(Carrera::find()->where(['StatusCarr' => 1])
									->orderBy(['nombcarr'=>SORT_ASC])
									->all(), 'idCarr', 'NombCarr');
			}

			else {
				$carreras = ArrayHelper::map(Carrera::find()->where(['in', 'idcarr', $carreras_user])
														->orderBy(['nombcarr'=>SORT_DESC])
														->all(), 'idCarr', 'NombCarr');
			}


			#$carreras = ArrayHelper::map(Carrera::find()->where(['StatusCarr' => 1])
			#						->orderBy(['nombcarr'=>SORT_ASC])
			#						->all(), 'idCarr', 'NombCarr');
			$periodos = ArrayHelper::map(Periodolectivo::find()
															->orderBy(['idper'=>SORT_DESC])
															->all(), 'idper', 'DescPerLec');