widgets/Mallas.php

SELECT * FROM `equivalencia` WHERE (`asignatura`='68628') AND (`equivalencia` IN ('8807', '8808', '8673', '8672', '8675', '8676', '8517', '8519', '8520', '8681', '8681', '8526', '67884', '8698', '8696', '8692', '8691', '8852', '8850', '8693', '8694', '67634', '8861', '8858', '8706', '8862', '8705', '67632', '8715', '7470', '8717', '8866', '8712', '7899', '8869', '7989', '8871', '8720', '8722', '8875', '8723', '8723', '8876', '8877', '8878', '8879', '8880', '8882', '7576', '8841', '8884', '8886', '8887', '8889', '8891', '8892', '8855', '8893', '8890', '8894', '8895', '7583', '8125', '7587', '8903', '67708', '8896', '8898', '8899', '8900', '8901', '8897', 'BQM01'))
---

				//}

				$equivalencia = Equivalencia::find()
					->where(['asignatura' => $malla->idasignatura])
					->andWhere(['equivalencia' => $id_notas])
					->one();

SELECT * FROM `notasalumnoasignatura` WHERE (`CIInfPer`='0801754870') AND (`aprobada`=1)
---
	public function getNotas($cedula)
	{

		$notas = Notasalumnoasignatura::find()
			->where(['CIInfPer' => $this->cedula, 'aprobada' => 1])
			->all();