views/notassic/_search.php

/* @var $form yii\widgets\ActiveForm */

//$matriculas = Matricula::find()->where(['CIInfPer' => '0802252833'])->asArray()->all();
$matriculas = ArrayHelper::getColumn(MallaEstudiante::find()->Where(['cedula' => $model->cedula])->all(), 'carrera');
$carreras = ArrayHelper::getColumn(Carrera::find()->where(['idCarr'=> $matriculas])->all(), 'idCarr');
$dataPost=ArrayHelper::map(Carrera::find()->Where(['culminacion' => 1, 'idCarr'=> $carreras ])->all(), 'idCarr', 'NombCarr');
---
SELECT * FROM `malla_estudiante` WHERE `cedula`='0802126102'
SELECT * FROM `carrera` WHERE `idCarr`='046'
SELECT * FROM `carrera` WHERE 0=1