views/notassic/index.php

					if ($model->estado == 'APROBADA' && $model['calificacion'] > 25 &&
						$model['calificacion'] <= 40) $nota = (round($model['calificacion']/4, 1));

					$notas = Notasalumnoasignatura::find()
						->joinWith('matricula0')
						->joinWith('idAsig0')
						->joinWith('matricula0.idCarr0')
						->where(['notasalumnoasignatura.CIInfPer' => $model['cedula'],
							'matricula.idCarr' => (intval($model['idcarrera'])),
							'matricula.idSemestre' =>  $model['nivel'],
							'notasalumnoasignatura.idAsig' => $model['codigo'],
							'notasalumnoasignatura.CalifFinal' => ($nota)
						])
						->orderBy('carrera.NombCarr ASC, matricula.idSemestre ASC, asignatura.NombAsig ASC')
						->one();
---
SELECT `notasalumnoasignatura`.* FROM `notasalumnoasignatura` LEFT JOIN `matricula` ON `notasalumnoasignatura`.`idMatricula` = `matricula`.`idMatricula` LEFT JOIN `asignatura` ON `notasalumnoasignatura`.`idAsig` = `asignatura`.`IdAsig` LEFT JOIN `carrera` ON `matricula`.`idCarr` = `carrera`.`idCarr` WHERE (`notasalumnoasignatura`.`CIInfPer`='0802126102') AND (`matricula`.`idCarr`=46) AND (`matricula`.`idSemestre`='1') AND (`notasalumnoasignatura`.`idAsig`=8594) AND (`notasalumnoasignatura`.`CalifFinal`=7) ORDER BY `carrera`.`NombCarr`, `matricula`.`idSemestre`, `asignatura`.`NombAsig`