views/equivalencia/index.php

SELECT COUNT(*) FROM `equivalencia` WHERE `asignatura` LIKE '%7820%'
---
	                }
		],
            'equivalencia',
		[
			'label'=>'Asignatura',
			'format'=>'text',//raw, html
			'content'=>function($data){
				$nombre = '';
				$modelo = Asignatura::findOne($data->equivalencia);
				if(!empty($modelo)) $nombre = $modelo->NombAsig;
				return $nombre;
	                }
		],