views/matricula/_search.php

//$matriculas = ArrayHelper::getColumn(MallaEstudiante::find()->Where(['cedula' => $model->cedula])->all(), 'carrera');
//$carreras = ArrayHelper::getColumn(Carrera::find()->where(['idCarr'=> $matriculas])->all(), 'idCarr');
//$dataPost=ArrayHelper::map(Carrera::find()->Where(['culminacion' => 1, 'idCarr'=> $carreras ])->all(), 'idCarr', 'NombCarr');
$dataPost=ArrayHelper::map(Periodolectivo::find()
					->andWhere(['>','idper', 107 ])
					#->limit(12)
					->orderBy(['idper' => SORT_DESC])->all(), 'idper', 'DescPerLec');
---
SELECT * FROM `periodolectivo` WHERE `idper` > 107 ORDER BY `idper` DESC