models/Equivalencia.php

SELECT * FROM `asignatura` WHERE `IdAsig`='8682'
SELECT * FROM `asignatura` WHERE `IdAsig`='8847'
---
	public function beforeSave($insert) {


		if (parent::beforeSave($insert)) {
			// ...custom code here...

			$verifica = false;

			$asignatura = Asignatura::find()
					->where(['IdAsig' => $this->asignatura])
					->one();


			if (!isset($asignatura)){
				$this->addError('asignatura', "No existe la Asignatura.");
				$verifica = false;
				return $verifica;
				exit;}
			else {
				 $verifica = true;
				// Yii::app()->Informacion->CIInfPer.setFlash('error', "Data2 failed!");

			}

			$equivalencia = Asignatura::find()
					->where(['IdAsig' => $this->equivalencia])
					->one();