models/Factura.php

SELECT SUM(valor) FROM `abono_factura` WHERE `idfactura`=16156
---
	public function sumaAbono()
    {
		$query = (new \yii\db\Query())->from('abono_factura');
		$sum = $query->where(['idfactura'=>$this->id])->sum('valor');