models/Usuario.php

    public static function findByUsername($username)
    {
        return static::findOne(['LoginUsu' => $username, 'StatusUsu' => 1]);
---
SELECT * FROM `usuario` WHERE (`LoginUsu`='1802251759') AND (`StatusUsu`=1)